source("gauss_seidel.R")

trelica_fink_matrix <- matrix(c(
  1, 0, -1, -0.86, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, # Equação (1)
  0, 1, 0, -0.5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, # Equação (2)
  0, 0, 1, 0, 0.5, 0, -0.5, 0, 0, 0, 0, 0, 0, -1, # Equação (3)
  0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, # Equação (4)
  0, 0, 0, 0, 0, 0, 0, 0.5, 0, 0, -0.5, -1, 0, 1, # Equação (5)
  0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, # Equação (6)
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0.86, 0, 1, 0, 0, # Equação (7)
  0, 0, 0, 0, 0, 0, 0, 0, 0, -0.5, 0, 0, 1, 0, # Equação (8)
  0, 0, 0, 0, 0, 0, 0, 0, 1, -1, 0, 0, 0, 0, # Equação (9)
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, # Equação (10)
  0, 0, 0, 0, 0, 0.86, 0.5, -0.5, -0.86, 0, 0, 0, 0, 0, # Equação (11)
  0, 0, 0, 0, 0, 0.5, 0.86, 0.86, 0.5, 0, 0, 0, 0, 0, # Equação (12)
  0, 0, 0, 1, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, # Equação (13)
  0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0 # Equação (14)
), nrow = 14, byrow = TRUE)

trelica_fink_b <- c(0, 0, 0, 0, 0, 0, 0, 0, -0.5, 0.86, 0, 2, 0.5, 0.86)
names(trelica_fink_b) <- c(
  "Ax", "Ay", "Fab", "Fag", "Fbg", "Ffg", "Fbf", "Fcf", "Fef", "Fde", "Fce", "Fdc", "Dy", "Fbc"
)

xk <- c(0, 2, -3, 3, 0, 3, 0, 0, 3, 3, 0, -3, 2, -2)

solucao_gauss_seidel <- gauss_seidel(trelica_fink_matrix, trelica_fink_b, xk)
cat("Gauss-Seidel:\n")
print(solucao_gauss_seidel)
